tutorials/buoyantBoussinesqSimple4PCMFoam/squareEPCM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 317;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 322;
    }

    right
    {
        type            fixedValue;
        value           uniform 312;
    }

    top
    {
	type		zeroGradient;
    }

    bottom
    {
	type		zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }
}
// ************************************************************************* //
